cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'ack'
brew 'zsh'
#brew 'coreutils'
brew 'go'
brew 'godep'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'

#Config tools
brew 'pkg-config'
brew 'autoconf'
brew 'automake'
brew 'ssh-copy-id'
brew 'gdbm'

#general dev env
brew 'python'
#brew 'awscli'
brew 'halibut'
brew 'libyaml'

##devops
brew 'ansible'
brew 'packer'
brew 'siege'

## Messaging
brew 'rabbitmq'

##scala env
brew 'scala'
brew 'sbt'

##storage
brew 'postgresql'
brew 'redis'
brew 'mysql'
brew 'sqlite'
brew 'mongodb'
brew 'elasticsearch'

##networking
brew 'nmap'
brew 'tmux'
brew 'mosh'

##other tools
brew 'hugo'

cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'mapbox-studio'
cask 'seashore'
cask 'slack'
cask 'transmission'
cask 'vlc'
